Ran Plan for 2 projects:

1. project: `infradev` dir: `infraeks` workspace: `dev`
1. project: `infraprod` dir: `infraeks` workspace: `prod`

### 1. project: `infradev` dir: `infraeks` workspace: `dev`
<details><summary>Show Output</summary>

```diff
 Please verify the terraform plan output of Dev instance . If output looks fine , then apply the changes and Merge the codebase

aws_vpc.example: Refreshing state... [id=vpc-087c9dd0a2a9d4ba8]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_vpc.example has been deleted
- resource "aws_vpc" "example" {
      - arn                              = "arn:aws:ec2:us-west-2:189161884001:vpc/vpc-087c9dd0a2a9d4ba8" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "30.0.0.0/28" -> null
      - default_network_acl_id           = "acl-0e6f1c5132860b938" -> null
      - default_route_table_id           = "rtb-00a68f99f475782cd" -> null
      - default_security_group_id        = "sg-0a01215d141b14642" -> null
      - dhcp_options_id                  = "dopt-04413864b44ca7f16" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = false -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-087c9dd0a2a9d4ba8" -> null
      - instance_tenancy                 = "default" -> null
      - ipv6_netmask_length              = 0 -> null
      - main_route_table_id              = "rtb-00a68f99f475782cd" -> null
      - owner_id                         = "189161884001" -> null
      - tags                             = {
          - "env"  = "dev"
          - "name" = "dev-vpc"
        } -> null
      - tags_all                         = {
          - "env"  = "dev"
          - "name" = "dev-vpc"
        } -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_vpc.example will be created
+ resource "aws_vpc" "example" {
      + arn                                  = (known after apply)
      + cidr_block                           = "30.0.0.0/28"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "env"  = "dev"
          + "name" = "dev-vpc"
        }
      + tags_all                             = {
          + "env"  = "dev"
          + "name" = "dev-vpc"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p infradev`
* :put_litter_in_its_place: To **delete** this plan click [here](https://455f-142-93-45-192.eu.ngrok.io/lock?id=mjgit007%252Feks_sample%252Finfraeks%252Fdev)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p infradev`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. project: `infraprod` dir: `infraeks` workspace: `prod`
<details><summary>Show Output</summary>

```diff
 Please verify the terraform plan output of Prod instance . If output looks fine , then apply the changes and Merge the codebase

aws_vpc.example: Refreshing state... [id=vpc-0c15b6285af2eaec8]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_vpc.example has been deleted
- resource "aws_vpc" "example" {
      - arn                              = "arn:aws:ec2:us-west-2:189161884001:vpc/vpc-0c15b6285af2eaec8" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "30.0.0.0/28" -> null
      - default_network_acl_id           = "acl-0a03c50b2b11610b7" -> null
      - default_route_table_id           = "rtb-020cdd53047a33f52" -> null
      - default_security_group_id        = "sg-0716d4015036a9a98" -> null
      - dhcp_options_id                  = "dopt-04413864b44ca7f16" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = false -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-0c15b6285af2eaec8" -> null
      - instance_tenancy                 = "default" -> null
      - ipv6_netmask_length              = 0 -> null
      - main_route_table_id              = "rtb-020cdd53047a33f52" -> null
      - owner_id                         = "189161884001" -> null
      - tags                             = {
          - "env"  = "prod"
          - "name" = "prod-vpc"
        } -> null
      - tags_all                         = {
          - "env"  = "prod"
          - "name" = "prod-vpc"
        } -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_vpc.example will be created
+ resource "aws_vpc" "example" {
      + arn                                  = (known after apply)
      + cidr_block                           = "30.0.0.0/28"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "env"  = "prod"
          + "name" = "prod-vpc"
        }
      + tags_all                             = {
          + "env"  = "prod"
          + "name" = "prod-vpc"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p infraprod`
* :put_litter_in_its_place: To **delete** this plan click [here](https://455f-142-93-45-192.eu.ngrok.io/lock?id=mjgit007%252Feks_sample%252Finfraeks%252Fprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p infraprod`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
